#include "ovl0/halsprite.h"

#include "sys/gtl.h"
#include "sys/hal_gu.h"
#include "sys/om.h"
#include "sys/system_03_1.h"
#include "sys/trig_rand.h"

#include <ssb_types.h>

#include <PR/gu.h>
#include <PR/mbi.h>
#include <PR/ultratypes.h>

// structs
struct Temp001 {
    /* 0x00 */ struct Temp001 *next;
    /* 0x04 */ f32 unk04; // x
    /* 0x08 */ f32 unk08; // y
    /* 0x0C */ f32 unk0C; // z
    /* 0x10 */ f32 unk10; // roll
    /* 0x14 */ f32 unk14; // pitch
    /* 0x18 */ f32 unk18; // yaw
    /* 0x1C */ f32 unk1C; // scale x
    /* 0x20 */ f32 unk20; // scale y
    /* 0x24 */ f32 unk24; // scale z
    /* 0x28 */ u8 unk28;
    /* 0x29 */ u8 unk29;
    /* 0x2A */ u16 unk2A;
    /* 0x2C */ Mtx4f unk2C; // transformation matrix?
    /* 0x6C */ Mtx4f unk6C;
    /* 0xAC */ f32 unkAC;
    /* 0xB0 */ f32 unkB0;
    /* 0xB4 */ void (*unkB4)(void); // destructor/cleanup; could have args
    /* 0xB8 */ u16 unkB8;
    /* 0xBA */ u8 padBA[0xC0 - 0xBA];
}; // sizeof == 0xC0

struct Temp003 {
    /* 0x00 */ struct Temp003 *next;
    /* 0x04 */ u16 unk04;
    /* 0x06 */ u16 unk06;
    /* 0x08 */ u8 unk08;
    /* 0x09 */ u8 unk09;
    /* 0x0A */ u16 unk0A;
    /* 0x0C */ u16 unk0C;
    /* 0x0E */ u16 unk0E;
    /* 0x10 */ u8 *unk10; // pointer to sprite command bytecode
    /* 0x14 */ f32 unk14;
    /* 0x18 */ f32 unk18;
    /* 0x1C */ f32 unk1C;
    /* 0x20 */ f32 unk20;
    /* 0x24 */ f32 unk24;
    /* 0x28 */ f32 unk28;
    /* 0x2C */ f32 unk2C;
    /* 0x30 */ f32 unk30;
    /* 0x34 */ f32 unk34;
    /* 0x38 */ f32 unk38;
    /* 0x3C */ f32 unk3C;
    /* 0x40 */ f32 unk40;
    /* 0x44 */ f32 unk44;
    /* 0x48 */ struct DObj *unk48;
    /* 0x4C */ struct Temp001 *unk4C;
    /* 0x50 */ f32 unk50;
    /* 0x54 */ union {
        u16 half;
        f32 f;
    } unk54; // or an f32
    /* 0x58 */ f32 unk58;
}; // sizeof >= 0x56

// data
// color dither type (G_CD_MAGICSQ)
u8 D_ovl0_800D5D50[4] = {00, 00, 00, 00};
// alpha dither type (G_AD_PATTERN)
u8 D_ovl0_800D5D54[4]  = {00, 00, 00, 00};
u16 D_ovl0_800D5D58[2] = {0000, 0000};
u8 D_ovl0_800D5D5C[4]  = {0x7B, 00, 00, 00};

// bss
struct Temp002 *D_ovl0_800D6350;
struct Temp002 *D_ovl0_800D6358[16];
struct Temp003 *D_ovl0_800D6398;
// typing might be off? could be part of array below?
// it looks like a static array of pointers
struct Temp001 **D_ovl0_800D639C;
struct Temp001 *D_ovl0_800D63A0[8];
// struct Temp001 **D_ovl0_800D639C[9];

// command counts
s32 D_ovl0_800D63C0[8];
// image entry counts
s32 D_ovl0_800D63E0[8];
// command arrays
struct SpriteCommand **D_ovl0_800D6400[8];
// image entry arrays
struct SpriteEntry **D_ovl0_800D6420[8];

u32 D_ovl0_800D6440;
void (*D_ovl0_800D6444)(struct Temp003 *);
u16 D_ovl0_800D6448;
u16 D_ovl0_800D644A;
// number of 'whatever's given out
u16 D_ovl0_800D644C;
u16 D_ovl0_800D644E;
u16 D_ovl0_800D6450;
u16 D_ovl0_800D6452;
// head of some sort of singly linked list
struct Temp001 *D_ovl0_800D6454;
struct Temp003 *D_ovl0_800D6458;

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunknown-pragmas"

// alloc_n_sized_whatevers
s32 func_ovl0_800CE040(s32 count, u32 size) {
    struct Temp001 *buf;
    s32 i;

    D_ovl0_800D6454 = NULL;
    for (i = 0; i < count; i++) {
        buf = hal_alloc(size, 4);
        if (buf == NULL) { return i; }
        buf->next       = D_ovl0_800D6454;
        D_ovl0_800D6454 = buf;
    }

    D_ovl0_800D644C = 0;
    D_ovl0_800D6452 = 0;

    return i;
}

// get_whatever
struct Temp001 *func_ovl0_800CE0D8(u8 arg0, u16 arg1) {
    struct Temp001 *out;

    out = D_ovl0_800D6454;
    if (out != NULL) {
        D_ovl0_800D6454 = out->next;
        out->unk2A      = 1;
        out->unk29      = *D_ovl0_800D5D5C;
        out->unkB4      = NULL;
        out->unk04 = out->unk08 = out->unk0C = 0.0f;
        out->unk10 = out->unk14 = out->unk18 = 0.0f;
        out->unk1C = out->unk20 = out->unk24 = 1.0f;

        out->unk28 = arg0;
        out->unkB8 = arg1;

        D_ovl0_800D644C++;
        if (D_ovl0_800D6452 < D_ovl0_800D644C) { D_ovl0_800D6452 = D_ovl0_800D644C; }
    }

    return out;
}

// drop_whatever
void func_ovl0_800CE188(struct Temp001 *arg0) {
    if (arg0->unkB4 != NULL) { arg0->unkB4(); }

    arg0->next      = D_ovl0_800D6454;
    D_ovl0_800D6454 = arg0;
    D_ovl0_800D644C--;
}

// union with u8 and u16?
struct FourBytes {
    u8 b0, b1, b2, b3;
};

struct Temp002 {
    /* 0x00 */ struct Temp002 *next;
    /* 0x04 */ u16 unk04;
    /* 0x06 */ u16 unk06; // flags?
    /* 0x08 */ u8 unk08;  // load bank idx?
    /* 0x09 */ u8 unk09;
    /* 0x0A */ s8 unk0A;
    /* 0x0B */ u8 unk0B;
    /* 0x0C */ u16 unk0C;
    /* 0x0E */ u16 unk0E;
    /* 0x10 */ u16 unk10;
    /* 0x12 */ u16 unk12;
    /* 0x14 */ u8 *unk14; // command bytecode ?
    /* 0x18 */ u16 unk18; // cusor into unk14 ?
    /* 0x1A */ u16 unk1A;
    /* 0x1C */ u16 unk1C;
    /* 0x1E */ u16 unk1E; // total frames (+1?)
    /* 0x20 */ f32 unk20;
    /* 0x24 */ f32 unk24;
    /* 0x28 */ f32 unk28;
    /* 0x2C */ f32 unk2C;
    /* 0x30 */ f32 unk30; // x?
    /* 0x34 */ f32 unk34; // y?
    /* 0x38 */ f32 unk38; // angle?
    /* 0x3C */ f32 unk3C;
    /* 0x40 */ f32 unk40;
    /* 0x44 */ f32 unk44;
    /* 0x48 */ struct FourBytes unk48;
    ///* 0x49 */ u8 unk49;
    ///* 0x4A */ u8 unk4A;
    ///* 0x4B */ u8 unk4B;
    // /* 0x4C */ struct Temp001 *unk4C;
    /* 0x4C */ struct FourBytes unk4C;
    ///* 0x4D */ u8 unk4D;
    ///* 0x4E */ u8 unk4E;
    ///* 0x4F */ u8 unk4F;
    ///* 0x50 */ u8 unk50[4];
    /* 0x50 */ struct FourBytes unk50;
    ///* 0x50 */ u8 unk50;
    ///* 0x51 */ u8 unk51;
    ///* 0x52 */ u8 unk52;
    ///* 0x53 */ u8 unk53;
    /* 0x54 */ struct FourBytes unk54;
    /* 0x58 */ struct Temp003 *unk58;
    /* 0x5C */ struct Temp001 *unk5C;
}; // sizeof == 0x60

struct Temp001* func_ovl0_800CE1DC(struct Temp002 *arg0, s8 arg1) {
    arg0->unk5C = func_ovl0_800CE0D8(arg1, arg0->unk04);

    return arg0->unk5C;

    // WARNING: This is confirmed to return arg0->unk5C
}

struct Temp001* unref_ovl0_800CE218(struct Temp003 *arg0, s8 arg1) {
    arg0->unk4C = func_ovl0_800CE0D8(arg1, arg0->unk04);

    return arg0->unk4C;

    // WARNING: This might similarly return arg0->unk4C
}

struct SpriteBankCmds {
    /* 0x00 */ s32 count;
    /* 0x04 */ struct SpriteCommand *commands[1];
}; // sizeof == 4 + VLA

struct SpriteCommand {
    /* 0x00 */ u16 unk00;
    /* 0x02 */ u16 unk02; // texture id?
    /* 0x04 */ u16 unk04;
    /* 0x06 */ u16 unk06; // total frames?
    /* 0x08 */ s32 unk08; // flags?
    /* 0x0C */ f32 unk0C;
    /* 0x10 */ f32 unk10;
    /* 0x14 */ f32 unk14;
    /* 0x18 */ f32 unk18;
    /* 0x1C */ f32 unk1C;
    /* 0x20 */ f32 unk20;
    /* 0x24 */ f32 unk24;
    /* 0x28 */ f32 unk28;
    /* 0x2C */ f32 unk2C;
    /* 0x30 */ u8 bytecode[1];
}; // sizeof == 0x30 + VLA

struct SpriteBank {
    /* 0x00 */ s32 count;
    /* 0x04 */ struct SpriteEntry *entries[1];
}; // sizeof == 4 + VLA

enum HalSpriteBankFormat {
    HalSpriteFmtRGBA = 0,
    HalSpriteFmtYUV  = 1,
    HalSpriteFmtCI   = 2,
    HalSpriteFmtIA   = 3,
    HalSpriteFmtI    = 4
};

struct SpriteEntry {
    /* 0x00 */ u32 count;
    /* 0x04 */ s32 format;
    /* 0x08 */ s32 bitDepth;
    /* 0x0C */ s32 width;
    /* 0x10 */ s32 height;
    /* 0x14 */ s32 flags;
    // After this header, this are offsets to image data, then pallet data
    /* 0x18 */ void *sprOffsets[1];
    // void *palettes[count];
}; // sizeof == 0x18 + VLA

void func_ovl0_800CE254(s32 arg0, struct SpriteBankCmds *arg1, struct SpriteBank *arg2);
#ifdef NON_MATCHING
// nonmatching: reaglloc
// relocate_sprite_bank(loadIdx, cmds, imgs)
void func_ovl0_800CE254(s32 arg0, struct SpriteBankCmds *arg1, struct SpriteBank *arg2) {
    s32 i;
    u32 j;

    if (arg0 < 8) {
        D_ovl0_800D63C0[arg0] = arg1->count;
        D_ovl0_800D63E0[arg0] = arg2->count;
        D_ovl0_800D6400[arg0] = arg1->commands;
        D_ovl0_800D6420[arg0] = arg2->entries;

        // .....why?
        for (i = 1; i <= D_ovl0_800D63C0[arg0]; i++) {
            arg1->commands[i - 1] = (void *)((uintptr_t)arg1->commands[i - 1] + (uintptr_t)arg1);
        }
        // L800CE2E8
        for (i = 1; i <= D_ovl0_800D63E0[arg0]; i++) {
            arg2->entries[i - 1] = (void *)((uintptr_t)arg2->entries[i - 1] + (uintptr_t)arg2);
        }
        // L800CE320

